// обращает порядок чисел на месте
package main

import "fmt"

func main() {
	a := [...]int{0, 1, 2, 3, 4, 5}
	reverse(a[:])  // вернет массив в обраттном порядке
	reverse(a[2:]) // вернет срез в обраттном порядке первые два символа
	reverse(a[:2]) // вернет массив в обраттном порядке все то что находится с третьего символа. полчется свдиг влево на два символа
	reverse(a[:])  // вернет срез в обраттном порядке все то что находится с третьего символа. полчется свдиг влево на два символа
	fmt.Println(a)
}

func reverse(s []int) {
	for i, j := 0, len(s)-1; i < j; i, j = i+1, j-1 {
		s[i], s[j] = s[j], s[i]
	}
}
