package main

import "fmt"

func main() {
	var i interface{} = "hello" // Положили строку в "коробку"

	// 1. Грубый способ.
	// Мы уверены, что там строка. Всё проходит успешно.
	s := i.(string)
	fmt.Println(s) // Выведет: hello

	// 2. Безопасный способ.
	// Спрашиваем: "Там строка?".
	// Ответ: ok = true, s = "hello"
	s, ok := i.(string)
	fmt.Println(s, ok) // Выведет: hello true

	// 3. Безопасный способ (ошибка в типе).
	// Спрашиваем: "Там дробное число (float64)?".
	// Ответ: ok = false. Программа НЕ падает. f = 0 (нулевое значение).
	f, ok := i.(float64)
	fmt.Println(f, ok) // Выведет: 0 false

	// 4. Грубый способ (ошибка в типе).
	// Мы слепо требуем: "Дай мне float64!".
	// Но там лежит строка "hello".
	// Программа впадает в панику (panic) и ломается!
	f = i.(float64) // panic
	fmt.Println(f)
}
